LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.h
/*
 * ESP8266mDNS.h
 * (c) 2018, LaborEtArs
 *
 * Version 0.9 beta
 *
 *  Some notes (from LaborEtArs, 2018):
 *  Essentially, this is an rewrite of the original EPS8266 Multicast DNS code (ESP8266mDNS).
 *  The target of this rewrite was to keep the existing interface as stable as possible while
 *  adding and extending the supported set of mDNS features.
 *  A lot of the additions were basicly taken from Erik Ekman's lwIP mdns app code.
 *
 *  Supported mDNS features (in some cases somewhat limited):
 *  - Presenting a DNS-SD service to interested observers, eg. a http server by presenting _http._tcp service
 *  - Support for multi-level compressed names in input; in output only a very simple one-leven full-name compression is implemented
 *  - Probing host and service domains for uniqueness in the local network
 *  - Tiebreaking while probing is supportet in a very minimalistic way (the 'higher' IP address wins the tiebreak)
 *  - Announcing available services after successful probing
 *  - Using fixed service TXT items or
 *  - Using dynamic service TXT items for presented services (via callback)
 *  - Remove services (and un-announcing them to the observers by sending goodbye-messages)
 *  - Static queries for DNS-SD services (creating a fixed answer set after a certain timeout period)
 *  - Dynamic queries for DNS-SD services with cached and updated answers and user notifications
 *
 *
 *  Usage:
 *  In most cases, this implementation should work as a 'drop-in' replacement for the original
 *  ESP8266 Multicast DNS code. Adjustments to the existing code would only be needed, if some
 *  of the new features should be used.
 *
 *  For presenting services:
 *  In 'setup()':
 *    Install a callback for the probing of host (and service) domains via 'MDNS.setProbeResultCallback(probeResultCallback, &userData);'
 *    Register DNS-SD services with 'MDNSResponder::hMDNSService hService = MDNS.addService("MyESP", "http", "tcp", 5000);'
 *    (Install additional callbacks for the probing of these service domains via 'MDNS.setServiceProbeResultCallback(hService, probeResultCallback, &userData);')
 *    Add service TXT items with 'MDNS.addServiceTxt(hService, "c#", "1");' or by installing a service TXT callback
 *    using 'MDNS.setDynamicServiceTxtCallback(dynamicServiceTxtCallback, &userData);' or service specific
 *    'MDNS.setDynamicServiceTxtCallback(hService, dynamicServiceTxtCallback, &userData);'
 *    Call MDNS.begin("MyHostname");
 *
 *  In 'probeResultCallback(MDNSResponder* p_MDNSResponder, const char* p_pcDomain, MDNSResponder:hMDNSService p_hService, bool p_bProbeResult, void* p_pUserdata)':
 *    Check the probe result and update the host or service domain name if the probe failed
 *
 *  In 'dynamicServiceTxtCallback(MDNSResponder* p_MDNSResponder, const hMDNSService p_hService, void* p_pUserdata)':
 *    Add dynamic TXT items by calling 'MDNS.addDynamicServiceTxt(p_hService, "c#", "1");'
 *
 *  In loop():
 *    Call 'MDNS.update();'
 *
 *
 *  For querying services:
 *  Static:
 *    Call 'uint32_t u32AnswerCount = MDNS.queryService("http", "tcp");'
 *    Iterate answers by: 'for (uint32_t u=0; u<u32AnswerCount; ++u) { const char* pHostname = MDNS.answerHostname(u); }'
 *    You should call MDNS.removeQuery() sometimes later (when the answers are nott needed anymore)
 *
 *  Dynamic:
 *    Install a dynamic query by calling 'DNSResponder::hMDNSServiceQuery hServiceQuery = MDNS.installServiceQuery("http", "tcp", serviceQueryCallback, &userData);'
 *    The callback 'serviceQueryCallback(MDNSResponder* p_MDNSResponder, const hMDNSServiceQuery p_hServiceQuery, uint32_t p_u32AnswerIndex,
 *                                       enuServiceQueryAnswerType p_ServiceQueryAnswerType, bool p_bSetContent, void* p_pUserdata)'
 *    is called for any change in the answer set.
 *    Call 'MDNS.removeServiceQuery(hServiceQuery);' when the answers are not needed anymore
 *
 *
 *  Reference:
 *  Used mDNS messages:
 *  A (0x01):               eg. esp8266.local A OP TTL 123.456.789.012
 *  AAAA (01Cx):            eg. esp8266.local AAAA OP TTL 1234:5678::90
 *  PTR (0x0C, srv name):   eg. _http._tcp.local PTR OP TTL MyESP._http._tcp.local
 *  PTR (0x0C, srv type):   eg. _services._dns-sd._udp.local PTR OP TTL _http._tcp.local
 *  PTR (0x0C, IP4):        eg. 012.789.456.123.in-addr.arpa PTR OP TTL esp8266.local
 *  PTR (0x0C, IP6):        eg. 90.0.0.0.0.0.0.0.0.0.0.0.78.56.34.12.ip6.arpa PTR OP TTL esp8266.local
 *  SRV (0x21):             eg. MyESP._http._tcp.local SRV OP TTL PRIORITY WEIGHT PORT esp8266.local
 *  TXT (0x10):             eg. MyESP._http._tcp.local TXT OP TTL c#=1
 *
 *  Some NOT used message types:
 *  OPT (0x29):             eDNS
 *  NSEC (0x2F):            DNSSEC
 *
 *
 *  License (MIT license):
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files (the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions:
 *
 *    The above copyright notice and this permission notice shall be included in
 *    all copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *    THE SOFTWARE.
 *
 */

#ifndef ESP8266MDNS_H
#define ESP8266MDNS_H

#include <functional>   // for UdpContext.h
#include "WiFiUdp.h"
#include "lwip/udp.h"
#include "debug.h" // DEBUGV definition
#include "include/UdpContext.h"

#include "ESP8266WiFi.h"

/**
 * LEA_MDNSResponder
 */
namespace LEA_MDNSResponder {

//this should be defined at build time
#ifndef ARDUINO_BOARD
#define ARDUINO_BOARD "generic"
#endif

#define MDNS_IP4_SUPPORT
//#define MDNS_IP6_SUPPORT


#ifdef MDNS_IP4_SUPPORT
    #define MDNS_IP4_SIZE               4
#endif
#ifdef MDNS_IP6_SUPPORT
    #define MDNS_IP6_SIZE               16
#endif
/*
 * Maximum length for all service txts for one service
 */
#define MDNS_SERVICE_TXT_MAXLENGTH      1300
/*
 * Maximum length for a full domain name eg. MyESP._http._tcp.local
 */
#define MDNS_DOMAIN_MAXLENGTH           256
/*
 * Maximum length of on label in a domain name (length info fits into 6 bits)
 */
#define MDNS_DOMAIN_LABEL_MAXLENGTH     63
/*
 * Maximum length of a service name eg. http
 */
#define MDNS_SERVICE_NAME_LENGTH        15
/*
 * Maximum length of a service protocol name eg. tcp
 */
#define MDNS_SERVICE_PROTOCOL_LENGTH    3
/*
 * Default timeout for static service queries
 */
#define MDNS_QUERYSERVICES_WAIT_TIME    1000


/**
 * MDNSResponder
 */
class MDNSResponder {
public:
    /* INTERFACE */
    MDNSResponder(void);
    virtual ~MDNSResponder(void);
    
