LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.h
    // 'announce' can be called every time, the configuration of some service
    // changes. Mainly, this would be changed content of TXT items.
    bool announce(void);

    // Enable OTA update
    hMDNSService enableArduino(uint16_t p_u16Port,
                               bool p_bAuthUpload = false);
    
    // Domain name helper
    static bool indexDomain(char*& p_rpcDomain,
                            const char* p_pcDivider = "-",
                            const char* p_pcDefaultDomain = 0);
    
protected:
    /** STRUCTS **/
    /**
     * stcMDNSServiceTxt
     */
    typedef struct _stcMDNSServiceTxt {
        _stcMDNSServiceTxt* m_pNext;
        char*               m_pcKey;
        char*               m_pcValue;
        bool                m_bTemp;
        
        _stcMDNSServiceTxt(const char* p_pcKey = 0,
                           const char* p_pcValue = 0,
                           bool p_bTemp = false);
        _stcMDNSServiceTxt(const _stcMDNSServiceTxt& p_Other);
        ~_stcMDNSServiceTxt(void);
        
        _stcMDNSServiceTxt& operator=(const _stcMDNSServiceTxt& p_Other);
        bool clear(void);
        
        char* allocKey(size_t p_stLength);
        bool setKey(const char* p_pcKey,
                    size_t p_stLength);
        bool setKey(const char* p_pcKey);
        bool releaseKey(void);
        
        char* allocValue(size_t p_stLength);
        bool setValue(const char* p_pcValue,
                      size_t p_stLength);
        bool setValue(const char* p_pcValue);
        bool releaseValue(void);
        
        bool set(const char* p_pcKey,
                 const char* p_pcValue,
                 bool p_bTemp = false);
        
        bool update(const char* p_pcValue);
        
        size_t length(void) const;
    } stcMDNSServiceTxt;
    
    /**
     * stcMDNSTxts
     */
    typedef struct _stcMDNSServiceTxts {
        stcMDNSServiceTxt*  m_pTxts;
        
        _stcMDNSServiceTxts(void);
        _stcMDNSServiceTxts(const _stcMDNSServiceTxts& p_Other);
        ~_stcMDNSServiceTxts(void);
        
        _stcMDNSServiceTxts& operator=(const _stcMDNSServiceTxts& p_Other);
        
        bool clear(void);
        
        bool add(stcMDNSServiceTxt* p_pTxt);
        bool remove(stcMDNSServiceTxt* p_pTxt);

        bool removeTempTxts(void);
        
        stcMDNSServiceTxt* find(const char* p_pcKey);
        const stcMDNSServiceTxt* find(const char* p_pcKey) const;
        stcMDNSServiceTxt* find(const stcMDNSServiceTxt* p_pTxt);
        
        uint16_t length(void) const;
        
        size_t c_strLength(void) const;
        bool c_str(char* p_pcBuffer);
        
        size_t bufferLength(void) const;
        bool buffer(char* p_pcBuffer);
        
        bool compare(const _stcMDNSServiceTxts& p_Other) const;
        bool operator==(const _stcMDNSServiceTxts& p_Other) const;
        bool operator!=(const _stcMDNSServiceTxts& p_Other) const;
    } stcMDNSServiceTxts;
    
    /**
     * enuContentFlags
     */
    typedef enum _enuContentFlags {
        // Host
        ContentFlag_A           = 0x01,
        ContentFlag_PTR_IP4     = 0x02,
        ContentFlag_PTR_IP6     = 0x04,
        ContentFlag_AAAA        = 0x08,
        // Service
        ContentFlag_PTR_TYPE    = 0x10,
        ContentFlag_PTR_NAME    = 0x20,
        ContentFlag_TXT         = 0x40,
        ContentFlag_SRV         = 0x80,
    } enuContentFlags;

    /**
     * stcMDNS_MsgHeader
     */
    typedef struct _stcMDNS_MsgHeader {
        uint16_t        m_u16ID;            // Identifier
        bool            m_1bQR      : 1;    // Query/Response flag
        unsigned char   m_4bOpcode  : 4;    // Operation code
        bool            m_1bAA      : 1;    // Authoritative Answer flag
        bool            m_1bTC      : 1;    // Truncation flag
        bool            m_1bRD      : 1;    // Recursion desired
        bool            m_1bRA      : 1;    // Recursion available
        unsigned char   m_3bZ       : 3;    // Zero
        unsigned char   m_4bRCode   : 4;    // Response code
        uint16_t        m_u16QDCount;       // Question count
        uint16_t        m_u16ANCount;       // Answer count
        uint16_t        m_u16NSCount;       // Authority Record count
        uint16_t        m_u16ARCount;       // Additional Record count
        
        _stcMDNS_MsgHeader(uint16_t p_u16ID = 0,
                           bool p_bQR = false,
                           unsigned char p_ucOpcode = 0,
                           bool p_bAA = false,
                           bool p_bTC = false,
                           bool p_bRD = false,
                           bool p_bRA = false,
                           unsigned char p_ucRCode = 0,
                           uint16_t p_u16QDCount = 0,
                           uint16_t p_u16ANCount = 0,
                           uint16_t p_u16NSCount = 0,
                           uint16_t p_u16ARCount = 0);
    } stcMDNS_MsgHeader;
        
    /**
     * stcMDNS_RRDomain
     */
    typedef struct _stcMDNS_RRDomain {
        char            m_acName[MDNS_DOMAIN_MAXLENGTH];    // Encoded domain name
        uint16_t        m_u16NameLength;                    // Length (incl. '\0')
        
        _stcMDNS_RRDomain(void);
        _stcMDNS_RRDomain(const _stcMDNS_RRDomain& p_Other);
        
        _stcMDNS_RRDomain& operator=(const _stcMDNS_RRDomain& p_Other);
        
        bool clear(void);
        
        bool addLabel(const char* p_pcLabel,
                      bool p_bPrependUnderline = false);
        
        bool compare(const _stcMDNS_RRDomain& p_Other) const;
        bool operator==(const _stcMDNS_RRDomain& p_Other) const;
        bool operator!=(const _stcMDNS_RRDomain& p_Other) const;
        bool operator>(const _stcMDNS_RRDomain& p_Other) const;
        
        size_t c_strLength(void) const;
        bool c_str(char* p_pcBuffer);
    } stcMDNS_RRDomain;
    
    /**
     * stcMDNS_RRAttributes
     */
    typedef struct _stcMDNS_RRAttributes {
        uint16_t            m_u16Type;      // Type
        uint16_t            m_u16Class;     // Class, nearly always 'IN'
        
        _stcMDNS_RRAttributes(uint16_t p_u16Type = 0,
                              uint16_t p_u16Class = 1 /*DNS_RRCLASS_IN Internet*/);
        _stcMDNS_RRAttributes(const _stcMDNS_RRAttributes& p_Other);
        
        _stcMDNS_RRAttributes& operator=(const _stcMDNS_RRAttributes& p_Other);
    } stcMDNS_RRAttributes;
    
    /**
     * stcMDNS_RRHeader
     */
    typedef struct _stcMDNS_RRHeader {
        stcMDNS_RRDomain        m_Domain;
        stcMDNS_RRAttributes    m_Attributes;
        
