LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.h
        _stcMDNS_RRHeader(void);
        _stcMDNS_RRHeader(const _stcMDNS_RRHeader& p_Other);
        
        _stcMDNS_RRHeader& operator=(const _stcMDNS_RRHeader& p_Other);

        bool clear(void);
    } stcMDNS_RRHeader;
    
    /**
     * stcMDNS_RRQuestion
     */
    typedef struct _stcMDNS_RRQuestion {
        _stcMDNS_RRQuestion*    m_pNext;
        _stcMDNS_RRHeader       m_Header;
        bool                    m_bUnicast;     // Unicast reply requested
        
        _stcMDNS_RRQuestion(void);
    } stcMDNS_RRQuestion;
    
    /**
     * enuAnswerType
     */
    typedef enum _enuAnswerType {
        AnswerType_A,
        AnswerType_PTR,
        AnswerType_TXT,
        AnswerType_AAAA,
        AnswerType_SRV,
        AnswerType_Generic
    } enuAnswerType;
    
    /**
     * stcMDNS_RRAnswer
     */
    typedef struct _stcMDNS_RRAnswer {
        _stcMDNS_RRAnswer*  m_pNext;
        const enuAnswerType m_AnswerType;
        _stcMDNS_RRHeader   m_Header;
        bool                m_bCacheFlush;  // Cache flush command bit
        uint32_t            m_u32TTL;       // Validity time in seconds
        
        virtual ~_stcMDNS_RRAnswer(void);
        
        enuAnswerType answerType(void) const;
        
        bool clear(void);
        
    protected:
        _stcMDNS_RRAnswer(enuAnswerType p_AnswerType,
                          const stcMDNS_RRHeader& p_Header,
                          uint32_t p_u32TTL);
    } stcMDNS_RRAnswer;
    
#ifdef MDNS_IP4_SUPPORT
    /**
     * stcMDNS_RRAnswerA
     */
    typedef struct _stcMDNS_RRAnswerA : public stcMDNS_RRAnswer {
        IPAddress           m_IPAddress;
        
        _stcMDNS_RRAnswerA(const stcMDNS_RRHeader& p_Header,
                           uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerA(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerA;
#endif

    /**
     * stcMDNS_RRAnswerPTR
     */
    typedef struct _stcMDNS_RRAnswerPTR : public stcMDNS_RRAnswer {
        stcMDNS_RRDomain    m_PTRDomain;
        
        _stcMDNS_RRAnswerPTR(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerPTR(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerPTR;
    
    /**
     * stcMDNS_RRAnswerTXT
     */
    typedef struct _stcMDNS_RRAnswerTXT : public stcMDNS_RRAnswer {
        stcMDNSServiceTxts  m_Txts;
        
        _stcMDNS_RRAnswerTXT(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerTXT(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerTXT;
    
#ifdef MDNS_IP6_SUPPORT
    /**
     * stcMDNS_RRAnswerAAAA
     */
    typedef struct _stcMDNS_RRAnswerAAAA : public stcMDNS_RRAnswer {
        //TODO: IP6Address          m_IPAddress;
        
        _stcMDNS_RRAnswerAAAA(const stcMDNS_RRHeader& p_Header,
                              uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerAAAA(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerAAAA;
#endif

    /**
     * stcMDNS_RRAnswerSRV
     */
    typedef struct _stcMDNS_RRAnswerSRV : public stcMDNS_RRAnswer {
        uint16_t            m_u16Priority;
        uint16_t            m_u16Weight;
        uint16_t            m_u16Port;
        stcMDNS_RRDomain    m_SRVDomain;
        
        _stcMDNS_RRAnswerSRV(const stcMDNS_RRHeader& p_Header,
                             uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerSRV(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerSRV;
    
    /**
     * stcMDNS_RRAnswerGeneric
     */
    typedef struct _stcMDNS_RRAnswerGeneric : public stcMDNS_RRAnswer {
        uint16_t            m_u16RDLength;  // Length of variable answer
        uint8_t*            m_pu8RDData;    // Offset of start of variable answer in packet
        
        _stcMDNS_RRAnswerGeneric(const stcMDNS_RRHeader& p_Header,
                                 uint32_t p_u32TTL);
        ~_stcMDNS_RRAnswerGeneric(void);
        
        bool clear(void);
    } stcMDNS_RRAnswerGeneric;


    /**
     * enuProbingStatus
     */
    typedef enum _enuProbingStatus {
        ProbingStatus_WaitingForData,
        ProbingStatus_ReadyToStart,
        ProbingStatus_InProgress,
        ProbingStatus_Done
    } enuProbingStatus;

    /**
     * stcProbeInformation
     */
    typedef struct _stcProbeInformation {
        enuProbingStatus                m_ProbingStatus;
        uint8_t                         m_u8ProbesSent;
        unsigned long                   m_ulNextProbeTimeout;
        bool                            m_bConflict;
        bool                            m_bTiebreakNeeded;
        MDNSProbeResultCallbackFn       m_fnProbeResultCallback;
        void*                           m_pProbeResultCallbackUserdata;

        _stcProbeInformation(void);

        bool clear(bool p_bClearUserdata = false);
    } stcProbeInformation;


    /**
     * stcMDNSService
     */
    typedef struct _stcMDNSService {
        _stcMDNSService*                m_pNext;
        char*                           m_pcName;
        bool                            m_bAutoName;    // Name was set automatically to hostname (if no name was supplied)
        char*                           m_pcService;
        char*                           m_pcProtocol;
        uint16_t                        m_u16Port;
        uint8_t                         m_u8ReplyMask;
        stcMDNSServiceTxts              m_Txts;
        MDNSDynamicServiceTxtCallbackFn m_fnTxtCallback;
        void*                           m_pTxtCallbackUserdata;
        stcProbeInformation             m_ProbeInformation;

        _stcMDNSService(const char* p_pcName = 0,
                        const char* p_pcService = 0,
                        const char* p_pcProtocol = 0);
        ~_stcMDNSService(void);

        bool setName(const char* p_pcName);
        bool releaseName(void);
        
        bool setService(const char* p_pcService);
        bool releaseService(void);
        
        bool setProtocol(const char* p_pcProtocol);
        bool releaseProtocol(void);
    } stcMDNSService;

    /**
     * stcMDNSServiceQuery
     */
    typedef struct _stcMDNSServiceQuery {
        /**
         * stcAnswer
         */
        typedef struct _stcAnswer {
            /**
             * stcTTL
             */
            typedef struct _stcTTL {
                uint32_t    m_u32TTL;
                uint32_t    m_u32Millis;
                bool        m_bUpdateScheduled;

