LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.h
                _stcTTL(uint32_t p_u32TTL = 0,
                        uint32_t p_u32Millis = 0);
                bool set(uint32_t p_u32TTL,
                        uint32_t p_u32Millis);

                bool has80Percent(uint32_t p_u32Now) const;
                bool isOutdated(uint32_t p_u32Now) const;
            } stcTTL;
#ifdef MDNS_IP4_SUPPORT
            /**
             * stcIP4Address
             */
            typedef struct _stcIP4Address {
                _stcIP4Address* m_pNext;
                IPAddress       m_IPAddress;
                stcTTL          m_TTL;
                
                _stcIP4Address(IPAddress p_IPAddress,
                               uint32_t p_u32TTL = 0,
                               uint32_t p_u32Millis = 0);
            } stcIP4Address;
#endif
#ifdef MDNS_IP6_SUPPORT
            /**
             * stcIP6Address
             */
            typedef struct _stcIP6Address {
                _stcIP6Address* m_pNext;
                IP6Address      m_IPAddress;
                stcTTL          m_TTL;
            } stcIP6Address;
#endif

            _stcAnswer*         m_pNext;
            // The service domain is the first 'answer' (from PTR answer, using service and protocol) to be set
            // Defines the key for additional answer, like host domain, etc.
            stcMDNS_RRDomain    m_ServiceDomain;    // 1. level answer (PTR), eg. MyESP._http._tcp.local
            char*               m_pcServiceDomain;
            stcTTL              m_TTLServiceDomain;
            stcMDNS_RRDomain    m_HostDomain;       // 2. level answer (SRV, using service domain), eg. esp8266.local
            char*               m_pcHostDomain;
            uint16_t            m_u16Port;          // 2. level answer (SRV, using service domain), eg. 5000
            stcTTL              m_TTLHostDomainAndPort;
            stcMDNSServiceTxts  m_Txts;             // 2. level answer (TXT, using service domain), eg. c#=1
            char*               m_pcTxts;
            stcTTL              m_TTLTxts;
#ifdef MDNS_IP4_SUPPORT
            stcIP4Address*      m_pIP4Addresses;    // 3. level answer (A, using host domain), eg. 123.456.789.012
#endif
#ifdef MDNS_IP6_SUPPORT
            stcIP6Address*      m_pIP6Addresses;    // 3. level answer (AAAA, using host domain), eg. 1234::09
#endif
            uint32_t            m_u32ContentFlags;

            _stcAnswer(void);
            ~_stcAnswer(void);

            bool clear(void);
            
            char* allocServiceDomain(size_t p_stLength);
            bool releaseServiceDomain(void);
            
            char* allocHostDomain(size_t p_stLength);
            bool releaseHostDomain(void);
            
            char* allocTxts(size_t p_stLength);
            bool releaseTxts(void);
            
#ifdef MDNS_IP4_SUPPORT
            bool releaseIP4Addresses(void);
            bool addIP4Address(_stcIP4Address* p_pIP4Address);
            bool removeIP4Address(_stcIP4Address* p_pIP4Address);
            const stcIP4Address* findIP4Address(const IPAddress& p_IPAddress) const;
            stcIP4Address* findIP4Address(const IPAddress& p_IPAddress);
            uint32_t IP4AddressCount(void) const;
            const stcIP4Address* IP4AddressAtIndex(uint32_t p_u32Index) const;
            stcIP4Address* IP4AddressAtIndex(uint32_t p_u32Index);
#endif
#ifdef MDNS_IP6_SUPPORT
            bool releaseIP6Addresses(void);
            bool addIP6Address(_stcIP6Address* p_pIP6Address);
            bool removeIP6Address(_stcIP6Address* p_pIP6Address);
            const stcIP6Address* findIP6Address(const IPAddress& p_IPAddress) const;
            stcIP6Address* findIP6Address(const IPAddress& p_IPAddress);
            uint32_t IP6AddressCount(void) const;
            const stcIP6Address* IP6AddressAtIndex(uint32_t p_u32Index) const;
            stcIP6Address* IP6AddressAtIndex(uint32_t p_u32Index);
#endif
        } stcAnswer;

        _stcMDNSServiceQuery*       m_pNext;
        stcMDNS_RRDomain            m_ServiceTypeDomain;    // eg. _http._tcp.local
        MDNSServiceQueryCallbackFn  m_fnCallback;
        void*                       m_pUserdata;
        bool                        m_bLegacyQuery;
        bool                        m_bAwaitingAnswers;
        stcAnswer*                  m_pAnswers;

        _stcMDNSServiceQuery(void);
        ~_stcMDNSServiceQuery(void);

        bool clear(void);
        
        uint32_t answerCount(void) const;
        const stcAnswer* answerAtIndex(uint32_t p_u32Index) const;
        stcAnswer* answerAtIndex(uint32_t p_u32Index);
        uint32_t indexOfAnswer(const stcAnswer* p_pAnswer) const;
        
        bool addAnswer(stcAnswer* p_pAnswer);
        bool removeAnswer(stcAnswer* p_pAnswer);
        
        stcAnswer* findAnswerForServiceDomain(const stcMDNS_RRDomain& p_ServiceDomain);
        stcAnswer* findAnswerForHostDomain(const stcMDNS_RRDomain& p_HostDomain);
    } stcMDNSServiceQuery;

    /**
     * stcMDNSSendParameter
     */
    typedef struct _stcMDNSSendParameter {
    protected:
        /**
         * stcDomainCacheItem
         */
        typedef struct _stcDomainCacheItem {
            _stcDomainCacheItem*    m_pNext;
            const void*             m_pHostnameOrService;   // Opaque id for host or service domain (pointer)
            bool                    m_bAdditionalData;      // Opaque flag for special info (service domain included)
            uint16_t                m_u16Offset;            // Offset in UDP output buffer
            
            _stcDomainCacheItem(const void* p_pHostnameOrService,
                                bool p_bAdditionalData,
                                uint32_t p_u16Offset);
        } stcDomainCacheItem;
    
    public: 
        uint16_t                m_u16ID;                    // Query ID (used only in lagacy queries)
        stcMDNS_RRQuestion*     m_pQuestions;               // A list of queries
        uint8_t                 m_u8HostReplyMask;          // Flags for reply components/answers
        bool                    m_bLegacyQuery;             // Flag: Legacy query
        bool                    m_bResponse;                // Flag: Response to a query
        bool                    m_bAuthorative;             // Flag: Authorative (owner) response
        bool                    m_bCacheFlush;              // Flag: Clients should flush their caches
        bool                    m_bUnicast;                 // Flag: Unicast response
        bool                    m_bUnannounce;              // Flag: Unannounce service
        uint16_t                m_u16Offset;                // Current offset in UDP write buffer (mainly for domain cache)
        stcDomainCacheItem*     m_pDomainCacheItems;        // Cached host and service domains
        
        _stcMDNSSendParameter(void);
        ~_stcMDNSSendParameter(void);
        
        bool clear(void);
        
        bool shiftOffset(uint16_t p_u16Shift);
        
        bool addDomainCacheItem(const void* p_pHostnameOrService,
                                bool p_bAdditionalData,
                                uint16_t p_u16Offset);
        uint16_t findCachedDomainOffset(const void* p_pHostnameOrService,
                                        bool p_bAdditionalData) const;
    } stcMDNSSendParameter;
    
    // Instance variables
    stcMDNSService*                 m_pServices;
    UdpContext*                     m_pUDPContext;
    char*                           m_pcHostname;
    stcMDNSServiceQuery*            m_pServiceQueries;
    WiFiEventHandler                m_DisconnectedHandler;
    WiFiEventHandler                m_GotIPHandler;
    MDNSDynamicServiceTxtCallbackFn m_fnServiceTxtCallback;
    void*                           m_pServiceTxtCallbackUserdata;
    stcProbeInformation             m_HostProbeInformation;

